In [2]:
import numpy as pd
import pandas as pd
import os

In [4]:
os.chdir('/Users/kumarnitish/Downloads/')

In [5]:
atheletes_df=pd.read_csv("athletes.csv")

In [6]:
atheletes_df.head()

,id,name,nationality,sex,date_of_birth,height,weight,sport,gold,silver,bronze,info
0,736041664,A Jesus Garcia,ESP,male,1969-10-17,1.72,64.0,athletics,0,0,0,NaN
1,532037425,A Lam Shin,KOR,female,1986-09-23,1.68,56.0,fencing,0,0,0,NaN
2,435962603,Aaron Brown,CAN,male,1992-05-27,1.98,79.0,athletics,0,0,1,NaN
3,521041435,Aaron Cook,MDA,male,1991-01-02,1.83,80.0,taekwondo,0,0,0,NaN
4,33922579,Aaron Gate,NZL,male,1990-11-26,1.81,71.0,cycling,0,0,0,NaN

In [8]:
atheletes_df.count()

id               11538
name             11538
nationality      11538
sex              11538
date_of_birth    11538
height           11208
weight           10879
sport            11538
gold             11538
silver           11538
bronze           11538
info               131
dtype: int64

In [9]:
atheletes_df.columns

Index(['id', 'name', 'nationality', 'sex', 'date_of_birth', 'height', 'weight',
       'sport', 'gold', 'silver', 'bronze', 'info'],
      dtype='object')

In [10]:
atheletes_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11538 entries, 0 to 11537
Data columns (total 12 columns):
id               11538 non-null int64
name             11538 non-null object
nationality      11538 non-null object
sex              11538 non-null object
date_of_birth    11538 non-null object
height           11208 non-null float64
weight           10879 non-null float64
sport            11538 non-null object
gold             11538 non-null int64
silver           11538 non-null int64
bronze           11538 non-null int64
info             131 non-null object
dtypes: float64(2), int64(4), object(6)
memory usage: 1.1+ MB

In [11]:
atheletes_df.isnull().sum()

id                   0
name                 0
nationality          0
sex                  0
date_of_birth        0
height             330
weight             659
sport                0
gold                 0
silver               0
bronze               0
info             11407
dtype: int64

In [12]:
atheletes_df.nunique()

id               11538
name             11517
nationality        207
sex                  2
date_of_birth     5595
height              82
weight             123
sport               28
gold                 6
silver               3
bronze               3
info               131
dtype: int64

## Groupby Clause on a Single Column

In [53]:
atheletes_df.groupby('nationality').mean().head()

                       id    height     weight  gold    silver  bronze
nationality
AFG          1.815734e+08  1.736667  74.000000   0.0  0.000000     0.0
ALB          5.374894e+08  1.761667  67.333333   0.0  0.000000     0.0
ALG          5.076919e+08  1.756324  70.316667   0.0  0.029412     0.0
AND          6.118264e+08  1.712000  64.000000   0.0  0.000000     0.0
ANG          4.042884e+08  1.762308  73.346154   0.0  0.000000     0.0

## Groupby Clause on a Multiple Column

In [73]:
atheletes_df.groupby(['nationality','sport']).mean().head()

                                    id  height  weight  gold  silver  bronze
nationality sport
AFG         athletics      127831280.0   1.700    61.5   0.0     0.0     0.0
            judo           289057786.0   1.810    99.0   0.0     0.0     0.0
ALB         aquatics       768201306.0   1.865    76.0   0.0     0.0     0.0
            athletics      619659664.5   1.770    65.5   0.0     0.0     0.0
            weightlifting  224607308.0   1.650    60.5   0.0     0.0     0.0

## Based on the Sport,find the Average of gold silver Bronze Won

In [57]:
atheletes_df.groupby('sport')['gold','silver','bronze'].mean().head()

                gold    silver    bronze
sport
aquatics    0.083045  0.077509  0.073356
archery     0.062500  0.062500  0.062500
athletics   0.027931  0.027084  0.026238
badminton   0.046512  0.046512  0.046512
basketball  0.083333  0.083333  0.083333

## Based on the Nationality,Mean of the medals won

In [77]:
atheletes_df.groupby('nationality')['gold','silver','bronze'].mean().head(10)

                gold    silver  bronze
nationality
AFG          0.00000  0.000000     0.0
ALB          0.00000  0.000000     0.0
ALG          0.00000  0.029412     0.0
AND          0.00000  0.000000     0.0
ANG          0.00000  0.000000     0.0
ANT          0.00000  0.000000     0.0
ARG          0.09417  0.004484     0.0
ARM          0.03125  0.093750     0.0
ARU          0.00000  0.000000     0.0
ASA          0.00000  0.000000     0.0

In [78]:
#To Cross Check Nationality AFG having how many count in the Dataframe

atheletes_df[atheletes_df['nationality']=='AFG'].count()

id               3
name             3
nationality      3
sex              3
date_of_birth    3
height           3
weight           3
sport            3
gold             3
silver           3
bronze           3
info             0
dtype: int64

## To find the mean of the medals based on the Nationality using 'agg' Function

In [79]:
atheletes_df.groupby('nationality')['gold','silver','bronze'].agg('mean').head()

             gold    silver  bronze
nationality
AFG           0.0  0.000000     0.0
ALB           0.0  0.000000     0.0
ALG           0.0  0.029412     0.0
AND           0.0  0.000000     0.0
ANG           0.0  0.000000     0.0

## Calculate min, max, mean, and median using 'agg' function.

In [80]:
atheletes_df.agg({'height':['min','max','mean','median']})

          height
min     1.210000
max     2.210000
mean    1.766282
median  1.760000

## Size will give you the Count as in sql,it will go with groupby clause

In [81]:
atheletes_df.groupby('sport')['gold','silver','bronze'].size().head()

sport
aquatics      1445
archery        128
athletics     2363
badminton      172
basketball     288
dtype: int64